/* eslint-disable react/prop-types */
/* eslint-disable react/jsx-indent-props */
/* eslint-disable react/jsx-indent */
/* eslint-disable indent */
import * as React from 'react';
import Box from '@mui/material/Box';
import Modal from '@mui/material/Modal';
import ClearIcon from '@mui/icons-material/Clear';
import ButtonCustom from '../Button';
import styles from './index.module.scss';

const style = {
    position: 'absolute',
    top: '50%',
    left: '50%',
    transform: 'translate(-50%, -50%)',
    width: 426,
    bgcolor: 'background.paper',
    // border: '2px solid #000',
    boxShadow: 24,
    p: 4,
    textAlign: 'center',
    borderRadius: '20px',
};

export default function ModalFinish() {
    const [open, setOpen] = React.useState(false);
    const handleOpen = () => setOpen(true);
    const handleClose = () => setOpen(false);

    return (
        <div>
            <ButtonCustom onClick={handleOpen} nameButton="Xóa" className="btn btn-danger fix_width" />
            <Modal
                open={open}
                onClose={handleClose}
                aria-labelledby="modal-modal-title"
                aria-describedby="modal-modal-description"
            >
                <Box sx={style}>
                    <div className={styles.header}>
                        <ClearIcon onClick={handleClose} />
                    </div>
                    <div className={styles.img}>
                        <svg width="104" height="120" viewBox="0 0 104 120" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M9.41546 54.67L6.58546 57.498C4.24734 59.8435 4.24734 63.6385 6.58546 65.984L16.4855 75.882C18.0475 77.4436 20.5795 77.4436 22.1415 75.882L27.9995 70.026V98C27.9995 99.1046 28.8949 100 29.9995 100C31.104 100 31.9995 99.1046 31.9995 98V66.026L38.0255 60H55.9995V116H33.9995C32.8949 116 31.9995 115.105 31.9995 114C31.9995 112.895 31.104 112 29.9995 112C28.8949 112 27.9995 112.895 27.9995 114C27.9995 117.314 30.6858 120 33.9995 120H97.9995C101.313 120 103.999 117.314 103.999 114V60C103.999 57.7909 102.209 56 99.9995 56H42.0255L56.0835 41.942L75.8835 22.142C77.445 20.58 77.445 18.048 75.8835 16.486L65.9855 6.58601C64.8602 5.46057 63.3339 4.82829 61.7425 4.82829C60.151 4.82829 58.6247 5.46057 57.4995 6.58601L54.6695 9.41601L47.5995 2.34401C45.6133 0.355948 42.7296 -0.444169 40.003 0.236254C37.2764 0.916677 35.1067 2.97785 34.2875 5.66601L30.7315 17.364C27.0541 16.8581 23.3519 18.1028 20.7271 20.7276C18.1023 23.3524 16.8575 27.0546 17.3635 30.732L5.65946 34.288C2.97227 35.1087 0.912624 37.279 0.23348 40.0054C-0.445665 42.7318 0.355262 45.6147 2.34346 47.6L9.41546 54.67ZM19.3135 73.054L9.41546 63.156C9.0399 62.7809 8.82889 62.2718 8.82889 61.741C8.82889 61.2102 9.0399 60.7012 9.41546 60.326L26.3855 43.356L37.6995 54.67L35.8195 56.548C35.7875 56.578 35.7575 56.608 35.7275 56.64L19.3135 73.054ZM99.9995 114C99.9995 115.105 99.104 116 97.9995 116H75.9995V60H99.9995V114ZM71.9995 60V116H59.9995V60H71.9995ZM40.5275 51.842L29.2135 40.528L40.5275 29.214L51.8415 40.528L40.5275 51.842ZM60.3275 9.41601C60.7026 9.04045 61.2116 8.82943 61.7425 8.82943C62.2733 8.82943 62.7823 9.04045 63.1575 9.41601L73.0575 19.312L54.6695 37.7L43.3555 26.386L60.3275 9.41601ZM38.1115 6.83401C38.5205 5.48896 39.6056 4.45739 40.9696 4.1169C42.3337 3.77641 43.7763 4.17699 44.7695 5.17201L51.8415 12.244L40.0415 24.044C39.4558 22.8135 38.6652 21.6916 37.7035 20.726C36.7828 19.8266 35.7215 19.0835 34.5615 18.526L38.1115 6.83401ZM23.5555 23.556C26.6824 20.4382 31.7425 20.4382 34.8695 23.556C35.8652 24.5503 36.5759 25.7935 36.9275 27.156L27.1555 36.928C25.7934 36.5764 24.5504 35.8665 23.5555 34.872C20.4375 31.7444 20.4375 26.6837 23.5555 23.556ZM4.12146 40.978C4.45301 39.6117 5.48215 38.5225 6.82746 38.114L18.5315 34.558C19.0882 35.7185 19.8313 36.7799 20.7315 37.7C21.697 38.6617 22.819 39.4523 24.0495 40.038L12.2495 51.838L5.17146 44.77C4.17492 43.781 3.77557 42.3388 4.12146 40.978Z" fill="#428DFF" />
                        </svg>
                    </div>
                    <p className={styles.content}>
                        Cập nhật thành công!
                    </p>
                </Box>
            </Modal>
        </div>
    );
}
